//- Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.
// let a =115;
// let b = 3;
// if (a-b>0){
//     console.log(a)
//     }
//     else if(a-b == 0){
//             console.log('chisla rivni')}

//--------------------------------------------------------------------------------
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let numberOFflat = 90;
// if (numberOFflat>0 && numberOFflat<=20){
//     console.log('pershiy pidizd')
// }else if( numberOFflat>20 && numberOFflat<=48){
//     console.log('druhiy pidizd')
// }else if(numberOFflat>48 && numberOFflat <=90){
//     console.log('tretiy pidizd')
// }else {
//     console.log('takix  nomeriv kvartir tut nema(')
// }
//---------------------------------------------------------------------------------------------
// /- Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО,
// якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = 10;
// // let result = number == 10? 'virno':'nevirno';
// // console.log(result);
//-------------------------------------------------------------------------------------------------

//- Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

// let x = {key:'value'};
// if (typeof x == "number"){
//     console.log(1)
// }else if( typeof x =='string'){
//     console.log(2)
// }else if (typeof x =='boolean'){
//     console.log('3')
// }else if(typeof x =='object'){
//     console.log(4)
// }else{
//     console.log('nevidomiy tip danih')}
//---------------------------------------------------------------------------------------------------
//- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
// let temprature = 22;
// if(temprature>10 && temprature<=22){
//     console.log('Idemo vchitysia')
// } else{
//     console.log('sidimo v doma')}
//-------------------------------------------------------------------------------------------------------
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення
// - що число не вірне ... .

// let number =-1;// - введіть число від 1-5;
// if ( number>5){
//     console.log('chislo nevirne');
// }else if( number <=0){
//     console.log('chislo nevirne')
// }
// switch (number) {
//     case 1: {
//         console.log('car')
//     } break;
//     case 2: {
//         console.log('motobike')
//     } break;
//     case 3: {
//         console.log('phone')
//     } break;
//     case 4: {
//         console.log('home')
//     } break;
//     case 5: {
//         console.log('beer')
//     } break;
// }
//--------------------------------------------------------------------------------------------
