//- Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
//  кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//  Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// if (friends.length >=3){
//     console.log('velykiy masiv v yakomu 3 i bilshe elementiv')
// }else {
//     console.log('malyi masiv menshe 3-oh elementiv')
// }
//--------------------------------------------------------------------------------------
//  - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//  Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома
//  іншими.

// let a =100;
// let b =64;
// let c = 33;
// let arr =[a,b,c];
// console.log(arr);
// let result = arr.sort();
// console.log(arr[1]);
//---------------------------------------------------------------------------------------------
//  - Перепишіть конструкцію if з використанням умовного оператора '?':
//  let result;
//  if (a + b < 4) {
//     result = 'Мало';
//  } else {
//     result = 'Багато';
//  }
//РОЗВЯЗОК:
// let a = 1;
// // let b= 4;
// // let c = a+b;
// // let result = c<4? 'malo':'bahato';
// // console.log(result);
//-----------------------------------------------------------------------------------------------------
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

// let number =0;
// let result = 0>number? 'negative': number>0? 'positiv':'tse null';
// console.log(result);
//------------------------------------------------------------------------------------------------------------


















