//Всі функції повинні бути описані стрілочним типом!!!!
// - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)
// let minNumber =( a,b,c)=>{
//     if(a<b && a<c){
//         console.log(a)
//     }else if (b<a && b<c){
//         console.log(b)
//     }else if ( c<a && c<b){
//         console.log(c)}
// };
// minNumber(1,2,3);
//------------------------------------------------------------------------------------------
// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)
// let maxNumber =(a,b,c)=> {
//     if( a>b && a>c){
//         console.log(a)
//     }else if (b>a && b>c){
//         console.log(b)
//     }else if( c>a && c>b){
//         console.log(c)
//     }
// };
// minNumber(12,13,14);
//----------------------------------------------------------------------------------------------------
// - створити функцію яка повертає найбільше число з масиву
// let maxNumberFromArr =arr =>{
//     let newArr =arr.sort(function(a, b){return a-b});
//     return newArr[newArr.length]
// };
// maxNumberFromArr([7,8,5,6,72,12,16,2,3,4,5]);
//---------------------------------------------------------------------------------------------------
// - створити функцію яка повертає найменьше число з масиву
// let maxNumberFromArr =arr =>{
//     let newArr =arr.sort(function(a, b){return b-a});
//     return newArr[newArr.length]
// };
// maxNumberFromArr([7,8,5,6,72,12,16,2,3,4,5]);
//--------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
// let sumFunction = (arr)=>{
//     let a=0;
//     for(item of arr){
//         a=item+a;
//     }
//     return a
// };
// let b=sumFunction([1,2,10]);
// console.log(b);
//--------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
let avgFunction = (arr)=>{
    let a=0;
    for(item of arr){
        a=item+a;
    }
    return a/arr.length;
};
let b=avgFunction([1,2,10]);
console.log(b);
//------------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);
let minMax = arr=>{
    let minMax =arr.sort(function (a,b) {return a-b
    });
    console.log(minMax[arr.length-1]);
    return minMax[0];
};
let min=minMax([1,2,10,14,22,17,895,0.2]);
console.log(min);
//---------------------------------------------------------------------------------------------------------------------
// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.
// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.
let randomFunction = limit=>{
    let arr=[];
    for( i=0; i<10; i++){
    arr.push(Math.round(Math.random()*limit));}
    console.log(arr);
    return arr
};
let newNewarr=randomFunction(100);
//---------------------------------------------------------------------------------------------------------------------
// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].
function reverse(arr) {
    let reverse =arr.sort(function (a,b) { return b-a
    });
    console.log(reverse)
}
reverse([1,2,3]);
//----------------------------------------------------------------------------------------------------------------------