//- створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
//
// function rectangleArea(a,b) {
//     let s = a*b;
//     return s
// }
// let rectanleS = rectangleArea(5,10);
// console.log(rectanleS);
//------------------------------------------------------------------------------------

// - створити функцію яка обчислює та повертає площу кола з радіусом r

//  function roundArea(r,) {
//      const p=3.14;
//     let area = p*(r**2);
//     return area
//  }
// let AreaRound= roundArea(12);
// console.log( AreaRound);
//--------------------------------------------------------------------------------------

// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
//     function cylinderArea(h,r) {
//         const p=3.14
//         let area =p*(r**2)*h;
//         return area
//     }
//      let AreaCylinder= cylinderArea(10,25);
// console.log(AreaCylinder);
//----------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив та виводить кожен його елемент
// function arrayVisioner(array) {
//     for ( a of array ){
//         console.log(a)
//     }
// }
// number=[1,2,3,4,5,6,7,8,9,10];
// arrayVisioner(number);
//-------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент

// function paragraph(text) {
//     document.write(`<p>${text}</p>`);
//     console.log(text)
// }
// paragraph('Hello Okten');

//--------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

// function unorderadList( textLi) {
//     document.write('<ul>');
//     document.write(`<li>${textLi}</li>`);
//     document.write(`<li>${textLi}</li>`);
//     document.write(`<li>${textLi}</li>`);
//     document.write('<ul>')
// }
// unorderadList('hello Okten');
//----------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.
// Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// function unli(textli,size) {
//     document.write('<ul>');
//     for(i =0; i<size; i++){
//         document.write(`<li>${textli} ${i}</li>`);
//     }
//     document.write('<ul>')
// }
// unli('hello okten',15);
///---------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// function arrayOfdata(array) {
//     document.write('<ul>');
//     for (i =0; i<array.length; i++) {
//         document.write(`<li>${array[i]}<li>`);
//     }
//     document.write('</ul>')
// }
// arrayOfdata([true,1,2,3,4,'hello okten']);
///--------------------------------------------------------------------------------------------------------------------

//- створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.

function info(array) {
    document.write('<div class="text">');
   for(i =0; i<array.length; i++){
       let infa = array[i];
       for( obj in infa){
           document.write(`<div class="color">${infa[obj]}</div>`)
       }
   }
    document.write('</div>')
}
info([{id:1,name:'Nazar', age:21},{id:2,name:'Vasia', age:22},{id:3,name:'kola',age:32}]);
//---------------------------------------------------------------------------------------------------------------------

