//7 -теорема Піфагора
// let n = 3;
// let m = 4;
// let k = 3 ** 2 + 4 ** 2;
// console.log(Math.sqrt(k))
//----------------------------

//     . Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.

// let h = 10;
// // let d = 4;
// // let s = 3.14 * (d/2) ** 2; // - площа основи
// // let v = s * h;//- обєм циліндра
// // console.log(v)

//----------------------------------------------------------------
// Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значення площі зберігати в змінній s.
// let height = 23;
// let width = 10;
// let s = height * width;
// console.log(s+' см^2')
//--------------------------------------------------------------------
//1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.
// let a = [1,2,3,4,5,6,7,8,9,10];
// let result = a[0] + a[1]+ a[2]+ a[3]+ a[4]+ a[5]+ a[6]+ a[7]+ a[8]+ a[9]; //- судячи  матеріалу на перші лекції по іншому не вийде
// console.log(result);
//----------------------------------------------------------------------
//2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр
// let book = {
//     name: 'rich Father',
//     pagesss: 86,
//     type: 'fantasy'
// };
// // Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори
// let book1 = {
//     name: 'Maugli',
//     pagesss: 206,
//     type: 'drama',
//     author: 'Hoking'
// };
// // Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт
// let arr = [book, book1];
// console.log(arr[0]);
// console.log(arr[1]);